farmertan81/Spot-Welder/STM32G474CE/src/stm32_settings_flash.c
/**
 * @file stm32_settings_flash.c
 * @brief Flash-based persistent settings implementation
 */

#include "stm32_settings_flash.h"

#include <stddef.h>
#include <stdio.h>
#include <string.h>

#include "stm32g4xx_hal.h"

/* CRC32 polynomial (Ethernet/ZIP standard) */
#define CRC32_POLY 0xEDB88320UL

/**
 * Calculate CRC32 checksum (software implementation).
 * @param data Pointer to data buffer
 * @param length Number of bytes to checksum
 * @return CRC32 value
 */
static uint32_t crc32_calculate(const uint8_t* data, uint32_t length) {
    uint32_t crc = 0xFFFFFFFFUL;

    for (uint32_t i = 0; i < length; i++) {
        crc ^= data[i];
        for (uint8_t j = 0; j < 8; j++) {
            crc = (crc >> 1) ^ (CRC32_POLY & (-(crc & 1)));
        }
    }

    return ~crc;
}

/**
 * Calculate CRC for settings payload (all bytes before crc32 field).
 * @param settings Pointer to settings struct
 * @return Computed CRC32 value
 */
static uint32_t settings_calc_crc(const PersistentSettings* settings) {
    const size_t crc_data_size = offsetof(PersistentSettings, crc32);
    return crc32_calculate((const uint8_t*)settings, (uint32_t)crc_data_size);
}

/**
 * Verify settings struct CRC.
 * @param settings Pointer to settings struct
 * @return true if CRC matches
 */
static bool settings_verify_crc(const PersistentSettings* settings) {
    return (settings_calc_crc(settings) == settings->crc32);
}

/**
 * Update CRC field in settings struct.
 * @param settings Pointer to settings struct to update
 */
static void settings_update_crc(PersistentSettings* settings) {
    settings->crc32 = settings_calc_crc(settings);
}

extern UART_HandleTypeDef huart1;

static void flash_debug_send(const char* msg) {
    if (!msg || huart1.Instance == NULL) return;
    HAL_UART_Transmit(&huart1, (uint8_t*)msg, (uint16_t)strlen(msg), 50U);
}

static void flash_debug_u32(const char* tag, uint32_t value) {
    char buf[96];
    snprintf(buf, sizeof(buf), "DBG,%s=0x%08lX\r\n", tag, (unsigned long)value);
    flash_debug_send(buf);
}

static void flash_prepare_erase_config(FLASH_EraseInitTypeDef* erase_config) {
    memset(erase_config, 0, sizeof(*erase_config));
    erase_config->TypeErase = FLASH_TYPEERASE_PAGES;

#if defined(FLASH_BANK_1)
#if defined(FLASH_OPTR_DBANK) && defined(FLASH_BANK_2)
    uint32_t dual_bank =
        (READ_BIT(FLASH->OPTR, FLASH_OPTR_DBANK) != 0U) ? 1U : 0U;
    if (dual_bank) {
        if (SETTINGS_FLASH_PAGE_NUMBER >= 128U) {
            erase_config->Banks = FLASH_BANK_2;
            erase_config->Page = SETTINGS_FLASH_PAGE_NUMBER - 128U;
        } else {
            erase_config->Banks = FLASH_BANK_1;
            erase_config->Page = SETTINGS_FLASH_PAGE_NUMBER;
        }
    } else {
        erase_config->Banks = FLASH_BANK_1;
        erase_config->Page = SETTINGS_FLASH_PAGE_NUMBER;
    }
#else
    erase_config->Banks = FLASH_BANK_1;
    erase_config->Page = SETTINGS_FLASH_PAGE_NUMBER;
#endif
#else
    erase_config->Page = SETTINGS_FLASH_PAGE_NUMBER;
#endif

    erase_config->NbPages = 1U;
}

bool settings_flash_init(void) {
    // HAL Flash module is initialized during HAL_Init() in main().
    // Defensively clear any Flash error flags that may be latched at boot
    // (e.g. PGSERR/OPTVERR left over from programming or a prior session).
    // Clearing SR error flags is a write-1-to-clear and does NOT require the
    // Flash to be unlocked. This ensures the first settings save starts from a
    // clean state instead of failing in the pre-erase wait. See the detailed
    // note in settings_flash_save().
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_SR_ERRORS);
    return true;
}

bool settings_flash_load(PersistentSettings* settings) {
    if (!settings) return false;

    // Read settings directly from Flash memory (no HAL call needed for read)
    const PersistentSettings* flash_settings =
        (const PersistentSettings*)SETTINGS_FLASH_BASE_ADDR;

    // Verify magic number
    if (flash_settings->magic != SETTINGS_MAGIC) {
        return false;  // Flash empty or invalid
    }

    // Verify version
    if (flash_settings->version != SETTINGS_VERSION) {
        return false;  // Incompatible version
    }

    // Verify CRC
    if (!settings_verify_crc(flash_settings)) {
        return false;  // Corrupted data
    }

    // Copy valid settings
    memcpy(settings, flash_settings, sizeof(PersistentSettings));
    return true;
}

bool settings_flash_save(const PersistentSettings* settings) {
    if (!settings) {
        flash_debug_send("DBG,FLASH_SAVE_NULL_INPUT\r\n");
        return false;
    }

    flash_debug_send("DBG,FLASH_SAVE_START\r\n");
    flash_debug_u32("FLASH_BASE", SETTINGS_FLASH_BASE_ADDR);
    flash_debug_u32("FLASH_PAGE_CFG", SETTINGS_FLASH_PAGE_NUMBER);

    HAL_StatusTypeDef status;

    // Create local copy and update CRC
    PersistentSettings settings_with_crc;
    memset(&settings_with_crc, 0, sizeof(settings_with_crc));
    memcpy(&settings_with_crc, settings, sizeof(PersistentSettings));
    settings_with_crc.magic = SETTINGS_MAGIC;
    settings_with_crc.version = SETTINGS_VERSION;
    settings_update_crc(&settings_with_crc);

    flash_debug_u32("FLASH_NEW_CRC", settings_with_crc.crc32);

    // Skip erase/program when payload CRC and headers are unchanged.
    const PersistentSettings* flash_settings =
        (const PersistentSettings*)SETTINGS_FLASH_BASE_ADDR;
    uint32_t flash_calc_crc = settings_calc_crc(flash_settings);

    flash_debug_u32("FLASH_CUR_CRC", flash_settings->crc32);
    flash_debug_u32("FLASH_CUR_CALC_CRC", flash_calc_crc);

    char cmp_buf[128];
    snprintf(cmp_buf, sizeof(cmp_buf),
             "DBG,FLASH_CMP,flash_crc=0x%08lX,new_crc=0x%08lX\r\n",
             (unsigned long)flash_calc_crc,
             (unsigned long)settings_with_crc.crc32);
    flash_debug_send(cmp_buf);

    const bool flash_header_valid =
        (flash_settings->magic == SETTINGS_MAGIC) &&
        (flash_settings->version == SETTINGS_VERSION);
    const bool flash_crc_valid =
        flash_header_valid && (flash_settings->crc32 == flash_calc_crc);

    if (flash_crc_valid && (flash_calc_crc == settings_with_crc.crc32)) {
        flash_debug_send("DBG,FLASH_SKIP_UNCHANGED\r\n");
        return true;
    }

    // Unlock Flash for write/erase
    status = HAL_FLASH_Unlock();
    if (status != HAL_OK) {
        flash_debug_send("DBG,FLASH_UNLOCK_FAILED\r\n");
        flash_debug_u32("FLASH_UNLOCK_ERR", HAL_FLASH_GetError());
        return false;
    }
    flash_debug_send("DBG,FLASH_UNLOCKED\r\n");

    // ---- Root-cause fix for persistent FLASH_SAVE_FAILED (HAL_ERR=0x80 PGSERR) ----
    // Diagnosis from the on-target DBG log: HAL_FLASHEx_Erase aborted in its
    // *pre-erase* FLASH_WaitForLastOperation() (PageError stayed 0xFFFFFFFF, no
    // page was ever touched) because FLASH->SR already had PGSERR set on entry.
    // A stale Flash error flag — or a leftover operation bit (PG/PER/PNB/FSTPG)
    // in FLASH->CR from an aborted earlier op — makes every subsequent erase
    // fail. Clear both before erasing so the erase starts from a clean state.
    // (Report SR/CR first so we can confirm what was stale on the next test.)
    flash_debug_u32("FLASH_SR_PRECLEAR", FLASH->SR);
    flash_debug_u32("FLASH_CR_PRECLEAR", FLASH->CR);
    __HAL_FLASH_CLEAR_FLAG(FLASH_FLAG_SR_ERRORS);
    CLEAR_BIT(FLASH->CR,
              FLASH_CR_PG | FLASH_CR_PER | FLASH_CR_PNB | FLASH_CR_FSTPG);
    flash_debug_u32("FLASH_SR_POSTCLEAR", FLASH->SR);

    // Erase the settings page
    FLASH_EraseInitTypeDef erase_config;
    flash_prepare_erase_config(&erase_config);

    flash_debug_u32("FLASH_ERASE_PAGE", erase_config.Page);
#if defined(FLASH_BANK_1)
    flash_debug_u32("FLASH_ERASE_BANK", erase_config.Banks);
#endif

    uint32_t page_error = 0xFFFFFFFFUL;
    status = HAL_FLASHEx_Erase(&erase_config, &page_error);
    if (status != HAL_OK) {
        flash_debug_send("DBG,FLASH_ERASE_FAILED\r\n");
        flash_debug_u32("FLASH_ERASE_STATUS", (uint32_t)status);
        flash_debug_u32("FLASH_ERASE_PAGE_ERR", page_error);
        flash_debug_u32("FLASH_ERASE_HAL_ERR", HAL_FLASH_GetError());
        HAL_FLASH_Lock();
        return false;
    }
    flash_debug_send("DBG,FLASH_ERASED\r\n");

    // Write settings to Flash (64-bit chunks for STM32G4)
    // STM32G4 Flash writes must be 64-bit (double word) aligned
    enum { SETTINGS_WRITE_BYTES = ((sizeof(PersistentSettings) + 7U) & ~7U) };
    uint8_t write_buffer[SETTINGS_WRITE_BYTES];
    memset(write_buffer, 0, sizeof(write_buffer));
    memcpy(write_buffer, &settings_with_crc, sizeof(PersistentSettings));

    const uint64_t* data_ptr = (const uint64_t*)write_buffer;
    uint32_t num_dwords = SETTINGS_WRITE_BYTES / 8U;
    flash_debug_u32("FLASH_DWORDS", num_dwords);

    for (uint32_t i = 0; i < num_dwords; i++) {
        uint32_t address = SETTINGS_FLASH_BASE_ADDR + (i * 8U);
        status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, address,
                                   data_ptr[i]);

        if (status != HAL_OK) {
            flash_debug_send("DBG,FLASH_WRITE_FAILED\r\n");
            flash_debug_u32("FLASH_WRITE_INDEX", i);
            flash_debug_u32("FLASH_WRITE_ADDR", address);
            flash_debug_u32("FLASH_WRITE_STATUS", (uint32_t)status);
            flash_debug_u32("FLASH_WRITE_HAL_ERR", HAL_FLASH_GetError());
            HAL_FLASH_Lock();
            return false;
        }
    }
    flash_debug_send("DBG,FLASH_WRITTEN\r\n");

    // Lock Flash
    status = HAL_FLASH_Lock();
    if (status != HAL_OK) {
        flash_debug_send("DBG,FLASH_LOCK_FAILED\r\n");
        flash_debug_u32("FLASH_LOCK_ERR", HAL_FLASH_GetError());
        return false;
    }
    flash_debug_send("DBG,FLASH_LOCKED\r\n");

    // Verify write by reading back
    PersistentSettings verify;
    if (!settings_flash_load(&verify)) {
        flash_debug_send("DBG,FLASH_VERIFY_LOAD_FAILED\r\n");
        return false;
    }

    if (verify.crc32 != settings_with_crc.crc32) {
        flash_debug_send("DBG,FLASH_VERIFY_CRC_MISMATCH\r\n");
        flash_debug_u32("FLASH_VERIFY_CRC_RD", verify.crc32);
        flash_debug_u32("FLASH_VERIFY_CRC_WR", settings_with_crc.crc32);
        return false;
    }

    flash_debug_send("DBG,FLASH_SAVE_SUCCESS\r\n");
    return true;
}

bool settings_flash_erase(void) {
    HAL_StatusTypeDef status;

    status = HAL_FLASH_Unlock();
    if (status != HAL_OK) return false;

    FLASH_EraseInitTypeDef erase_config;
    flash_prepare_erase_config(&erase_config);

    uint32_t page_error = 0;
    status = HAL_FLASHEx_Erase(&erase_config, &page_error);

    HAL_FLASH_Lock();

    return (status == HAL_OK);
}
